In [19]:
%matplotlib inline
import pandas as pd

In [2]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [3]:
len(titles)

244914

### How many movies are listed in the titles dataframe?

In [4]:
print("Number of movies listed in file :",titles['title'].nunique())

Number of movies listed in file : 223828

### What are the earliest two films listed in the titles dataframe?

In [5]:
print("Earileat two films are ")
titles.sort_values(by=['year'],ascending=True).iloc[0:2,:]

Earileat two films are

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:

print("Number of times Hamlet title is repeated is ",len(titles[titles['title']=="Hamlet"]))

Number of times Hamlet title is repeated is  20

### How many movies are titled "North by Northwest"?

In [7]:

print("Number of times Hamlet title is repeated is ",len(titles[titles['title']=="North by Northwest"]))

Number of times Hamlet title is repeated is  1

### When was the first movie titled "Hamlet" made?

In [8]:
print("Hamlet titled movie is first made in ",)
titles[titles['title']=="Hamlet"].sort_values(by=['year'],ascending=True).iloc[0:1,:]

Hamlet titled movie is first made in

        title  year
52521  Hamlet  1910

In [9]:

a=titles[titles['title']=="Hamlet"].sort_values(by=['year'],ascending=True).iloc[0:1,:]['year'].values[0]
print("Hamlet titled movie is first made in ",a)

Hamlet titled movie is first made in  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [10]:
titles[titles['title']=="Treasure Island"].sort_values(by=['year'],ascending=True)

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [11]:
titles[titles['year']==1950]

                          title  year
189          La soif des hommes  1950
268            Sohrab at Rustum  1950
308                       Gemma  1950
314                Rasuna valea  1950
524          Trial Without Jury  1950
...                         ...   ...
244200               Inmaculada  1950
244362        Golden Salamander  1950
244440  Prisoners in Petticoats  1950
244470  The Golden Gloves Story  1950
244820                 Doctor X  1950

[1113 rows x 2 columns]

In [12]:
print("Number of movies made in the yera 1950 is ",len(titles[titles['year']==1950]))

Number of movies made in the yera 1950 is  1113

### How many movies were made in the year 1960?

In [13]:
print("Number of movies made in the yera 1950 is ",len(titles[titles['year']==1960]))

Number of movies made in the yera 1950 is  1549

### How many movies were made from 1950 through 1959?

In [14]:
titles[(titles['year']>=1950) & (titles['year']<=1959)]

                          title  year
5                    Tight Spot  1955
8               Bao dao mei ren  1956
45           Trois de la marine  1957
48                    Hong hong  1956
61              Alarma in munti  1955
...                         ...   ...
244803             Touch and Go  1955
244817            White Feather  1955
244818      Carovana di canzoni  1955
244820                 Doctor X  1950
244841  Matros soshyol na bereg  1957

[12934 rows x 2 columns]

In [15]:
print("Number of movies made from 1950 to 1960 is ",len(titles[(titles['year']>=1950) & (titles['year']<=1959)]))

Number of movies made from 1950 to 1960 is  12934

### In what years has a movie titled "Batman" been released?

In [16]:
titles[titles['title']=="Batman"]

         title  year
39349   Batman  1943
240896  Batman  1989

In [17]:
titles[titles['title']=="Batman"]['year'].values

array([1943, 1989], dtype=int64)

### How many roles were there in the movie "Inception"?

In [18]:
df = pd.read_csv('cast.csv')

In [20]:
df.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [23]:
print("Number of roles in Inception movie is ",len(df[df['title']=="Inception"]))

Number of roles in Inception movie is  78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [26]:
print("Number of roles in the movie Inception are NOT ranked ny an n value ",df[df['title']=="Inception"]['n'].isnull().sum())

Number of roles in the movie Inception are NOT ranked ny an n value  27

### But how many roles in the movie "Inception" did receive an "n" value?

In [29]:
d=len(df[df['title']=="Inception"])-df[df['title']=="Inception"]['n'].isnull().sum()

In [30]:
print("Number of roles in the movie Inception did receive an n value ",d )

Number of roles in the movie Inception did receive an n value  51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [38]:
temp=df[df['title']=="North by Northwest"].sort_values(by='n')

In [42]:
print("Displaying the cast of North by Northwest in their correct n-value order ",temp['name'].values)

Displaying the cast of North by Northwest in their correct n-value order  ['Cary Grant' 'Eva Marie Saint' 'James Mason' 'Jessie Royce Landis'
 'Leo G. Carroll' 'Josephine Hutchinson' 'Philip Ober' 'Martin Landau'
 'Adam Williams' 'Edward Platt' 'Robert Ellenstein' 'Les Tremayne'
 'Philip Coolidge' 'Patrick McVey' 'Edward Binns' 'Ken Lynch'
 'Stanley Adams' 'Andy Albin' 'Don Anderson' 'Ernest Anderson'
 'Malcolm Atterbury' 'Tol Avery' 'Sam Bagley' 'Frank Baker' 'Alex Ball'
 'Baynes Barron' 'Brandon Beach' 'John Beradino' 'Stephen Bolster'
 'Steve Carruthers' 'Taggart Casey' 'Bill Catching' 'Bob (II) Coe'
 'David A. Cox' 'Walter Coy' 'Jimmy Cross' 'Jack Daly' 'John Damler'
 'Lawrence Dobkin' 'Daniel Elam' 'Tommy Farrell' 'Adolph Faylauer'
 'Paul Genge' 'Ned Glass' 'James Gonzalez' 'Tom Greenway' 'Robert Haines'
 'Stuart Hall' 'Len Hendry' 'Alfred Hitchcock' 'Stuart Holmes'
 'Hideo Inamura' 'Eugene Jackson' 'Bobby Johnson' 'Dick Johnstone'
 'Sid Kane' 'Kenner G. Kemp' 'Colin Kenny' 'Larry Leverett'
 'Carl M. Leviness' 'Alexander Lockwood' 'Frank Marlowe'
 'Tom (III) Marshall' 'Thomas Martin' 'James McCallion' 'Carl Milletaire'
 'Hans Moebus' 'Howard Negley' "Monty O'Grady" "Henry O'Neill"
 'Murray Pollack' 'Charles Postal' 'Hugh Pryor' 'Ralph Reed' 'John Roy'
 'Cosmo Sardo' 'Jeffrey Sayre' 'Jeffrey Sayre' 'Scott Seaton'
 'Harry Seymour' 'Robert Shayne' 'Larry Sherman' 'Jeremy Slate'
 'Olan Soule' 'Harvey Stephens' 'Bert Stevens' 'Harry Strang'
 'Joe Szorentini' 'Paul Togawa' 'Arthur Tovey' 'Dale Van Sickel'
 'Ray Weaver' 'Frank Wilcox' 'Lloyd (VI) Williams' 'Robert Williams'
 'Wilson Wood' 'Carleton Young' 'Ernesto Zambrano' 'Anne (II) Anderson'
 'Rama Bai' 'Audrey Betz' 'Lucille Curtis' 'Patricia Cutts' 'Jesslyn Fax'
 'Bess Flowers' 'Josephine Forsberg' 'Sally Fraser' 'Madge Kennedy'
 'Doreen Lang' 'Nora Marlowe' 'Maura McGiveney' 'Maudie Prickett'
 'Doris Singh' 'Helen Spring' 'Susan Whitney' 'Paula Winslowe']

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [41]:
df[(df['title']=="Sleuth") & (df['year']==1972)]

,title,year,name,type,character,n
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0

In [43]:
print("Displaying the entire cast, in n-order, of the 1972 film Sleuth ",df[(df['title']=="Sleuth") & (df['year']==1972)]['name'].values)

Displaying the entire cast, in n-order, of the 1972 film Sleuth  ['Michael Caine' 'Alec Cawthorne' 'Teddy Martin' 'John (II) Matthews'
 'Laurence Olivier' 'Eve (III) Channing']

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [44]:
df[(df['title']=="Sleuth") & (df['year']==2007)]

          title  year                 name     type          character    n
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

In [45]:
print("Displaying the entire cast, in n-order, of the 2007 film Sleuth ",df[(df['title']=="Sleuth") & (df['year']==2007)]['name'].values)

Displaying the entire cast, in n-order, of the 2007 film Sleuth  ['Kenneth Branagh' 'Michael Caine' 'Alec (II) Cawthorne' 'Jude Law'
 'Harold Pinter' 'Eve (II) Channing' "Carmel O'Sullivan"]

### How many roles were credited in the silent 1921 version of Hamlet?

In [46]:
df[(df['title']=="Hamlet") & (df['year']==1921)]

          title  year                    name     type         character    n
7789     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
458904   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
555034   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1135279  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2185558  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2375993  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2664423  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3062023  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3355176  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

In [47]:
print("Number of roles were credited in the silent 1921 version of Hamlet ",len(df[(df['title']=="Hamlet") & (df['year']==1921)]))

Number of roles were credited in the silent 1921 version of Hamlet  9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [48]:
df[(df['title']=="Hamlet") & (df['year']==1996)]

,title,year,name,type,character,n
1731,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
95861,Hamlet,1996,Richard Attenborough,actor,English Ambassador,2.0
158642,Hamlet,1996,Simon Russell Beale,actor,Second Gravedigger,37.0
214473,Hamlet,1996,David (V) Blair,actor,Attendant to Claudius,3.0
219554,Hamlet,1996,Brian Blessed,actor,Ghost of Hamlet's Father,4.0
250773,Hamlet,1996,Christopher Bowles,actor,Cadet in Play,NaN
260225,Hamlet,1996,Kenneth Branagh,actor,Hamlet,5.0
272749,Hamlet,1996,Richard Briers,actor,Polonius,6.0
294652,Hamlet,1996,Michael Bryant,actor,Priest,7.0
319501,Hamlet,1996,Peter Bygott,actor,Attendant to Claudius,8.0
344365,Hamlet,1996,Kenneth W Caravan,actor,Laertes Mob,NaN
500916,Hamlet,1996,Billy Crystal,actor,First Gravedigger,10.0
518572,Hamlet,1996,Charles Daish,actor,Stage Manager,11.0
576147,Hamlet,1996,G?rard Depardieu,actor,Reynaldo,13.0
598618,Hamlet,1996,Reece Dinsdale,actor,Guildenstern,14.0
604339,Hamlet,1996,Ken Dodd,actor,Yorick,15.0
656817,Hamlet,1996,Rob Edwards,actor,Lucianus,17.0
669232,Hamlet,1996,Jimmy Ellis,actor,Old Fortinbras,NaN
704270,Hamlet,1996,Nicholas Farrell,actor,Horatio,18.0
708468,Hamlet,1996,Ray Fearon,actor,Francisco,19.0
827066,Hamlet,1996,John Gielgud,actor,Priam,21.0
990819,Hamlet,1996,Charlton Heston,actor,Player King,23.0
1074691,Hamlet,1996,Ravil Isyanov,actor,Cornelius,24.0
1082161,Hamlet,1996,Derek Jacobi,actor,Claudius,25.0
1210509,Hamlet,1996,Jeffery Kissoon,actor,Fortinbras's Captain,27.0
1316617,Hamlet,1996,Jack Lemmon,actor,Marcellus,29.0
1400732,Hamlet,1996,Anthony Maddalena,actor,Elsinore Courtier,NaN
1417360,Hamlet,1996,Michael Maloney,actor,Laertes,31.0
1489191,Hamlet,1996,Ian McElhinney,actor,Barnardo,30.0
1549128,Hamlet,1996,John Mills,actor,Old Norway,33.0
1556082,Hamlet,1996,Jimi Mistry,actor,Sailor Two,34.0
1588218,Hamlet,1996,Frank (II) Morgan,actor,Pyrrhus,NaN
2040040,Hamlet,1996,Andrew Schofield,actor,Young Lord,38.0
2052796,Hamlet,1996,Orlando Seale,actor,Boatman,NaN
2067657,Hamlet,1996,Rufus Sewell,actor,Fortinbras,39.0
2151526,Hamlet,1996,Timothy Spall,actor,Rosencrantz,40.0
2154960,Hamlet,1996,John Spencer-Churchill,actor,Fortinbras's Captain,32.0
2221910,Hamlet,1996,Thomas Szekeres,actor,Young Hamlet,41.0
2259675,Hamlet,1996,Ben Thom,actor,First Player,42.0
2404091,Hamlet,1996,Don Warrington,actor,Voltimand,43.0
2453099,Hamlet,1996,Robin Williams,actor,Osric,45.0
2500066,Hamlet,1996,David Yip,actor,Sailor One,47.0
2508377,Hamlet,1996,Jimmy Yuill,actor,Alexander,NaN
2737885,Hamlet,1996,Julie Christie,actress,Gertrude,9.0
2814220,Hamlet,1996,Judi Dench,actress,Hecuba,12.0
2835947,Hamlet,1996,Angela Douglas,actress,Attendant to Gertrude,16.0
2940033,Hamlet,1996,Yvonne Gidden,actress,Doctor,20.0
2999610,Hamlet,1996,Rosemary Harris,actress,Player Queen,22.0
3119901,Hamlet,1996,Rowena King,actress,Attendant to Gertrude,26.0
3154270,Hamlet,1996,Sarah Lam,actress,Attendant to Gertrude,28.0
3451003,Hamlet,1996,Sian Radinger,actress,Prologue,35.0
3456114,Hamlet,1996,Melanie Ramsay,actress,Prostitute,NaN
3728751,Hamlet,1996,Perdita Weeks,actress,Second Player,44.0
3751232,Hamlet,1996,Kate Winslet,actress,Ophelia,46.0

In [53]:
credit=len(df[(df['title']=="Hamlet") & (df['year']==1996)])-df[(df['title']=="Hamlet") & (df['year']==1996)]['n'].isnull().sum()

In [55]:
print("Number of roles were credited in Branagh’s 1996 Hamlet is ",credit)

Number of roles were credited in Branagh’s 1996 Hamlet is  46

### How many "Hamlet" roles have been listed in all film credits through history?

In [57]:
df[(df['character']=="Hamlet")]

,title,year,name,type,character,n
6286,Sugar,2008,Hamlet Abreu,actor,Hamlet,58.0
97830,Top of the Town,1937,Mischa Auer,actor,Hamlet,6.0
125190,The Sound of Spying,2014,Jonathan Ball,actor,Hamlet,NaN
160794,Suivez cet avion,1989,Fran?ois Beaulieu,actor,Hamlet,26.0
161104,Nous sommes les autres,2017,Marc Beaupr?,actor,Hamlet,NaN
...,...,...,...,...,...,...
2615644,Hamlet_X,2003,Meret Becker,actress,Hamlet,NaN
2728421,Bill Shakespeare in Hollywood,2011,Rafika Chawishe,actress,Hamlet,NaN
2944632,Intikam Melegi/Kadin Hamlet,1976,Fatma Girik,actress,Hamlet,1.0
3355176,Hamlet,1921,Asta Nielsen,actress,Hamlet,1.0
3405990,Hamlet,2015,Maxine Peake,actress,Hamlet,1.0

In [58]:
print("Number of Hamlet roles have been listed in all film credits through history is ",len(df[(df['character']=="Hamlet")]))

Number of Hamlet roles have been listed in all film credits through history is  96

### How many people have played an "Ophelia"?

In [62]:
df[(df['character']=="Ophelia")]['name'].nunique()

115

In [63]:
print("Number of people have played an Ophelia is ", df[(df['character']=="Ophelia")]['name'].nunique())

Number of people have played an Ophelia is  115

### How many people have played a role called "The Dude"?

In [64]:
df[(df['character']=="The Dude")]['name'].nunique()

19

In [65]:
print("Number of people have played an The Dude is ", df[(df['character']=="The Dude")]['name'].nunique())

Number of people have played an The Dude is  19

### How many people have played a role called "The Stranger"?

In [66]:
df[(df['character']=="The Stranger")]['name'].nunique()

202

In [67]:
print("Number of people have played  a role called The Stranger is ", df[(df['character']=="The Stranger")]['name'].nunique())

Number of people have played  a role called The Stranger is  202

### How many roles has Sidney Poitier played throughout his career?

In [78]:
len(df[(df['name']=="Sidney Poitier")]['character'])

43

In [79]:
print("Number of roles Sidney Poitier played throughout his career ",len(df[(df['name']=="Sidney Poitier")]['character']))

Number of roles Sidney Poitier played throughout his career  43

### How many roles has Judi Dench played?

In [88]:
len(df[(df['name']=="Judi Dench")]['character']))

46

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [90]:
df[(df['name']=="Cary Grant") & (df['n']==2) & (df['year']>=1940) & (df['year']<=1949)].sort_values(by='year')

array(['Nick Arden', 'Roger Adams'], dtype=object)

In [94]:
df[(df['name']=="Cary Grant") & (df['n']==2) & (df['year']>=1940) & (df['year']<=1949)].sort_values(by='year')['character'].values

array(['Nick Arden', 'Roger Adams'], dtype=object)

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [92]:
df[(df['name']=="Cary Grant") & (df['n']==1) & (df['year']>=1940) & (df['year']<=1949)].sort_values(by='year')

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

In [93]:
df[(df['name']=="Cary Grant") & (df['n']==1) & (df['year']>=1940) & (df['year']<=1949)].sort_values(by='year')['character'].values

array(['Matt Howard', 'Walter Burns', 'C. K. Dexter Haven',
       'Johnnie Aysgarth', 'Leopold Dilg', "Patrick 'Pat' O'Toole",
       'Capt. Cassidy', 'Joe Adams -posing as Joe Bascopolous',
       'Jerry Flynn', 'Mortimer Brewster', 'Ernie Mott', 'Cole Porter',
       'Devlin', 'Dick Nugent', 'Dudley', 'Jim Blandings',
       'Dr. Madison Brown', 'Captain Henri Rochard'], dtype=object)

### How many roles were available for actors in the 1950s?

In [97]:
len(df[(df['type']=='actor') & (df['year']>=1950) & (df['year']<=1959)]['character'])

157738

### How many roles were available for actresses in the 1950s?

In [100]:
len(df[(df['type']=='actress') & (df['year']>=1950) & (df['year']<=1959)]['character'])

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [102]:
len(df[(df['n']==1) & (df['year']<=1980)]['character'])

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [103]:
len(df[(df['n']!=1) & (df['year']<=1980)]['character'])

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [109]:
df[(df['year']<=1980)]['n'].isnull().sum()

448347